In [1]:
import numpy as np
import pandas as pd

from numpy.random import randn

In [2]:
df = pd.DataFrame(randn(4,3),["A","B","C","D"],["Column1","Column2","Column3"])

In [3]:
df

    Column1   Column2   Column3
A  0.968394 -1.263838  0.067158
B  0.989661 -0.245177  1.952514
C  0.462870 -0.917685  1.501962
D  0.055571  0.211807 -0.247890

In [4]:
df > -1

   Column1  Column2  Column3
A     True    False     True
B     True     True     True
C     True     True     True
D     True     True     True

In [5]:
boolDf = df > -1
boolDf

   Column1  Column2  Column3
A     True    False     True
B     True     True     True
C     True     True     True
D     True     True     True

In [6]:
df[boolDf]

    Column1   Column2   Column3
A  0.968394       NaN  0.067158
B  0.989661 -0.245177  1.952514
C  0.462870 -0.917685  1.501962
D  0.055571  0.211807 -0.247890

In [7]:
df[df > 0]

    Column1   Column2   Column3
A  0.968394       NaN  0.067158
B  0.989661       NaN  1.952514
C  0.462870       NaN  1.501962
D  0.055571  0.211807       NaN

In [8]:
df["Column2"] > 0

A    False
B    False
C    False
D     True
Name: Column2, dtype: bool

In [9]:
df[df["Column2"] > 0]

    Column1   Column2  Column3
D  0.055571  0.211807 -0.24789

In [10]:
df["Column3"] < 0

A    False
B    False
C    False
D     True
Name: Column3, dtype: bool

In [11]:
df[df["Column3"] < 0]

    Column1   Column2  Column3
D  0.055571  0.211807 -0.24789

In [12]:
df[(df["Column2"] > 0) & (df["Column3"] < 0)]

    Column1   Column2  Column3
D  0.055571  0.211807 -0.24789

In [13]:
df[(df["Column2"] > 0) | (df["Column3"] < 0)]

    Column1   Column2  Column3
D  0.055571  0.211807 -0.24789

In [14]:
df["Column4"] = pd.Series(randn(4),index = ["A","B","C","D"])

In [15]:
df["Column5"] = randn(4)

In [16]:
df

    Column1   Column2   Column3   Column4   Column5
A  0.968394 -1.263838  0.067158  1.039029  2.328800
B  0.989661 -0.245177  1.952514 -1.721647 -2.535320
C  0.462870 -0.917685  1.501962 -1.205237  0.206285
D  0.055571  0.211807 -0.247890  0.063965  0.124348

In [17]:
df["Column6"] = ["newValue1","newValue2","newValue3","newValue4"]

In [18]:
df

    Column1   Column2   Column3   Column4   Column5    Column6
A  0.968394 -1.263838  0.067158  1.039029  2.328800  newValue1
B  0.989661 -0.245177  1.952514 -1.721647 -2.535320  newValue2
C  0.462870 -0.917685  1.501962 -1.205237  0.206285  newValue3
D  0.055571  0.211807 -0.247890  0.063965  0.124348  newValue4

In [19]:
df.set_index("Column6")

            Column1   Column2   Column3   Column4   Column5
Column6
newValue1  0.968394 -1.263838  0.067158  1.039029  2.328800
newValue2  0.989661 -0.245177  1.952514 -1.721647 -2.535320
newValue3  0.462870 -0.917685  1.501962 -1.205237  0.206285
newValue4  0.055571  0.211807 -0.247890  0.063965  0.124348

In [20]:
df

    Column1   Column2   Column3   Column4   Column5    Column6
A  0.968394 -1.263838  0.067158  1.039029  2.328800  newValue1
B  0.989661 -0.245177  1.952514 -1.721647 -2.535320  newValue2
C  0.462870 -0.917685  1.501962 -1.205237  0.206285  newValue3
D  0.055571  0.211807 -0.247890  0.063965  0.124348  newValue4

In [21]:
df.set_index("Column6",inplace = True)
df

            Column1   Column2   Column3   Column4   Column5
Column6
newValue1  0.968394 -1.263838  0.067158  1.039029  2.328800
newValue2  0.989661 -0.245177  1.952514 -1.721647 -2.535320
newValue3  0.462870 -0.917685  1.501962 -1.205237  0.206285
newValue4  0.055571  0.211807 -0.247890  0.063965  0.124348

In [22]:
df.index.names

FrozenList(['Column6'])